Revit 2027 API
AppearanceAssetEditScope.Cancel Method
 Cancels the edit scope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Cancel()
Public Sub Cancel
public:
void Cancel()
member Cancel : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, there is no opened transaction.
Remarks
 All the changes made after starting the EditScope will be discarded.
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace